[
    
      {
        "bookId": 1,
        "bookName": "The Dating Playbook for Men",
        "author": "Andrew Ferebee",
        "image": "https://i.ibb.co/cN2ph1j/book1.png",
        "review": "The Dating Playbook for Men is a comprehensive guide for those navigating the complexities of modern dating. With practical advice and actionable strategies, Ferebee empowers men to develop confidence, improve communication skills, and cultivate fulfilling relationships. Whether you're new to dating or seeking to enhance your approach, this book offers valuable insights and guidance.",
        "totalPages": 272,
        "rating": 4.6,
        "category": "Relationships",
        "tags": ["Dating", "Self-Help"],
        "publisher": "Knowledge for Men",
        "yearOfPublishing": 2015
      },
      {
        "bookId": 2,
        "bookName": "Why Do You Hate Money?",
        "author": "Bryce Leung & Kristy Shen",
        "image": "https://i.ibb.co/mXV0Brx/book2.png",
        "review": "Why Do You Hate Money? challenges conventional beliefs about money and invites readers to explore their relationship with finances. Wittels delves into the psychological and emotional factors that influence our attitudes towards money, offering insights and practical exercises to help readers overcome financial obstacles and cultivate a healthier mindset. Thought-provoking and illuminating, this book prompts readers to reevaluate their financial behaviors and beliefs.",
        "totalPages": 224,
        "rating": 4.4,
        "category": "Finance",
        "tags": ["Management", "Finance"],
        "publisher": "Independently published",
        "yearOfPublishing": 2019
      },
      {
        "bookId": 3,
        "bookName": "The Hate U Give",
        "author": "Angie Thomas",
        "image": "https://i.ibb.co/txXPHRj/book3.png",
        "review": "The Hate U Give is a powerful and timely novel that tackles themes of race, identity, and social justice. Through the eyes of protagonist Starr Carter, Thomas explores the complexities of navigating two worlds—the predominantly black neighborhood where Starr lives and the affluent, predominantly white prep school she attends. When Starr witnesses the fatal shooting of her childhood friend by a police officer, she is thrust into the spotlight and must find her voice amidst the turmoil. Thomas's gripping narrative and authentic characters make this a must-read for readers of all ages.",
        "totalPages": 464,
        "rating": 4.7,
        "category": "Young Adult",
        "tags": ["Justice", "Society"],
        "publisher": "Balzer + Bray",
        "yearOfPublishing": 2017
      },
      {
        "bookId": 4,
        "bookName": "The Scholarship Monthly Planner",
        "author": "Jocelyn Paonita Pearson",
        "image": "https://i.ibb.co/WxkfZkV/book4.png",
        "review": "The Scholarship Monthly Planner is an invaluable resource for students navigating the scholarship application process. With detailed timelines, organizational tools, and insider tips, this planner simplifies the complex task of finding and applying for scholarships. Whether you're a high school student preparing for college or a current college student seeking financial aid, this planner will help you stay organized and maximize your scholarship opportunities.",
        "totalPages": 168,
        "rating": 4.2,
        "category": "Education",
        "tags": ["Scholarships", "Planner"],
        "publisher": "Independently published",
        "yearOfPublishing": 2020
      },
      {
        "bookId": 5,
        "bookName": "Annotated Texas Family Code",
        "author": "Publisher's Editorial Staff",
        "image": "https://i.ibb.co/QMH9m8N/book5.png",
        "review": "The Annotated Texas Family Code is an essential reference for legal professionals, students, and anyone interested in Texas family law. This comprehensive guide provides annotations, case law summaries, and explanations of key statutes related to family law in Texas. Whether you're studying family law, practicing law in Texas, or navigating family legal matters, this annotated code offers invaluable insights and guidance.",
        "totalPages": 1768,
        "rating": 4.8,
        "category": "Law",
        "tags": ["Legal", "Texas"],
        "publisher": "West Academic Publishing",
        "yearOfPublishing": 2021
      },
      {
        "bookId": 6,
        "bookName": "Loving Jesus More",
        "author": "Philip Graham Ryken",
        "image": "https://i.ibb.co/q16PFBP/book6.png",
        "review": "In Loving Jesus More, Phil Ryken invites readers to deepen their relationship with Christ and experience the transformative power of His love. Through personal anecdotes, biblical insights, and practical guidance, Ryken encourages readers to cultivate a heart of devotion and surrender to Jesus. This book is a compelling reminder of the incomparable love of Christ and the joy of knowing Him intimately.",
        "totalPages": 176,
        "rating": 4.5,
        "category": "Christian Living",
        "tags": ["Faith", "Spirituality"],
        "publisher": "Crossway",
        "yearOfPublishing": 2001
      },
      {
        "bookId": 7,
        "bookName": "The Lost Art of Good Conversation",
        "author": "Sakyong Mipham",
        "image": "https://i.ibb.co/hgKm9W6/book7.png",
        "review": "The Lost Art of Good Conversation is a timely reminder of the importance of meaningful communication in our digital age. Drawing on Buddhist principles and personal experiences, Sakyong Mipham offers insights and practices to cultivate genuine connections and enhance the quality of our interactions. This book serves as a guide to reclaiming the lost art of conversation and fostering deeper connections with others.",
        "totalPages": 224,
        "rating": 4.3,
        "category": "Self-Help",
        "tags": ["Communication", "Mindfulness"],
        "publisher": "Harmony",
        "yearOfPublishing": 2017
      },
      {
        "bookId": 8,
        "bookName": "Cold Case Christianity",
        "author": "J. Warner Wallace",
        "image": "https://i.ibb.co/5skbLx3/book8.png",
        "review": "Cold Case Christianity is a compelling examination of the evidence for Christianity through the lens of a cold-case detective. Wallace applies investigative techniques to the claims of the New Testament, offering readers a logical and systematic approach to understanding the reliability of the Gospels. Whether you're a skeptic, a seeker, or a believer, this book provides thought-provoking insights into the case for Christianity.",
        "totalPages": 288,
        "rating": 4.6,
        "category": "Religion",
        "tags": ["Apologetics", "Christianity"],
        "publisher": "David C. Cook",
        "yearOfPublishing": 2013
      },
      {
        "bookId": 9,
        "bookName": "Spine of the Dragon",
        "author": "Kevin J. Anderson",
        "image": "https://i.ibb.co/k2k94n0/book9.png",
        "review": "Spine of the Dragon is an epic fantasy novel that immerses readers in a richly imagined world of dragons, magic, and political intrigue. Anderson masterfully weaves together multiple storylines, each brimming with action, suspense, and complex characters. From the towering peaks of the Dragon's Spine to the bustling cities of human kingdoms, this book delivers an enthralling adventure that will captivate fantasy enthusiasts.",
        "totalPages": 528,
        "rating": 4.4,
        "category": "Fantasy",
        "tags": ["Epic", "World-Building"],
        "publisher": "Tor Books",
        "yearOfPublishing": 2019
      }
    
    ]
  